import lab1.Book
import org.junit.jupiter.api.Assertions.*
import org.junit.jupiter.api.Test


internal class BookKtTest {

    @Test
    fun parserBooks() {
         val books = """1. Отцы и дети // И.С.Тургенев // 1862
            2. Горе от ума // А.С.Грибоедов // 1825
            3. Война и мир // Л.Н.Толстой // 1867
            4. Евгений Онегин // А.С.Пушкин // 1833"""

    }

    @Test
    fun oldestBook() {
        val books = """1. Отцы и дети // И.С.Тургенев // 1862
            2. Горе от ума // А.С.Грибоедов // 1825
            3. Война и мир // Л.Н.Толстой // 1867
            4. Евгений Онегин // А.С.Пушкин // 1833"""

    }

    @Test
    fun youngestBook() {
        val books = """1. Отцы и дети // И.С.Тургенев // 1862
            2. Горе от ума // А.С.Грибоедов // 1825
            3. Война и мир // Л.Н.Толстой // 1867
            4. Евгений Онегин // А.С.Пушкин // 1833"""

    }

    @Test
    fun longestNameBook() {
        val books = """1. Отцы и дети // И.С.Тургенев // 1862
            2. Горе от ума // А.С.Грибоедов // 1825
            3. Война и мир // Л.Н.Толстой // 1867
            4. Евгений Онегин // А.С.Пушкин // 1833"""
    }

    @Test
    fun shortestNameBook() {
        val books = """1. Отцы и дети // И.С.Тургенев // 1862
            2. Горе от ума // А.С.Грибоедов // 1825
            3. Война и мир // Л.Н.Толстой // 1867
            4. Евгений Онегин // А.С.Пушкин // 1833"""
    }
}